Tekla Open API Reference for Tekla Structures 2025
IEvents.ClashCheckDone Event
 The ClashCheckDone event is raised just after clash check is completed.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
event Events.ClashCheckDoneDelegate ClashCheckDone
Event ClashCheckDone As Events.ClashCheckDoneDelegate
Value
Type: Tekla.Structures.Model.Events.ClashCheckDoneDelegate
See Also
Reference
IEvents Interface
Tekla.Structures.Model Namespace